import React from 'react' // Імпортуємо React для використання JSX

// Функціональний компонент Footer
export default function Footer() {
  return (
    // JSX розмітка для футера
    <footer>
      {/* Текст, що повідомляє про захист авторських прав */}
      Всі права захищені &copy; Виконала Ломачинська Ольга{/* Символ авторських прав (©) */}
    </footer>
  );
}


// Імпорт React:
// Для роботи з JSX необхідно імпортувати React. Хоча в нових версіях React це не завжди обов'язково, але для сумісності з більш ранніми версіями та підтримки JSX цей імпорт все ще присутній.
// Компонент Footer:
// Це функціональний компонент, який повертає JSX-розмітку. Він відповідає за відображення футера на сторінці.
// &copy;:
// Це HTML-ентіті, яке відображає символ авторських прав (©), що є стандартним способом позначити авторські права.
// Повернення JSX:
// Компонент повертає JSX, що виглядає як звичайний HTML. Весь вміст футера, в даному випадку текст "Всі права захищені", буде відображатися на сторінці.
// Цей код створює простий футер для вашої сторінки, який відображає повідомлення про авторські права. Якщо є ще питання, не соромтеся звертатися!