// Імпортуємо необхідні модулі та компоненти
import React from 'react'; // Імпортуємо основний модуль React для створення компонентів
import ReactDOM from 'react-dom/client'; // Імпортуємо ReactDOM для рендеринга компонентів в DOM
import './index.css'; // Імпортуємо глобальні стилі для додатка
import App from './App'; // Імпортуємо головний компонент додатка (App)

// Створюємо корінь для рендеринга компонента
const root = ReactDOM.createRoot(document.getElementById('root')); 
// Використовуємо ReactDOM.createRoot для створення кореневого елемента React в DOM
// і передаємо йому елемент з ідентифікатором 'root', що буде контейнером для всіх компонентів.

root.render(
  // Вставляємо компонент App в корінь додатка, обгорнувши його в <React.StrictMode>
  // StrictMode допомагає виявляти проблеми під час розробки, але не має впливу на роботу додатка в продакшн-режимі.
  <React.StrictMode>
    <App /> {/* Головний компонент додатка */}
  </React.StrictMode>
);

// Імпорти:
// React: необхідно для створення компонентів у JSX.
// ReactDOM: використовується для рендеринга React компонентів у браузері.
// index.css: підключаємо стилі для всього додатка.
// App: головний компонент, який є кореневим для всіх інших компонентів в додатку.
// Рендеринг:
// За допомогою ReactDOM.createRoot ми створюємо корінь React дерева і прив'язуємо його до елемента з id root на сторінці.
// root.render(...) виконує рендеринг компонента App всередині цього кореня, обгорнутого в React.StrictMode для перевірки коду на можливі проблеми під час розробки.
// React.StrictMode:
//Це обгортка для виявлення потенційних проблем у коді, таких як небажані зміни стану та інші потенційно небезпечні практики.
//  Це корисно лише в режимі розробки.